Repository: msaqib52/edx-notifications
Catalog: edx_notifications/server/web/locale/*/LC_MESSAGES/djangojs.po
Languages: ja, pl

source: Announcements
ja: 告知
pl: Ogłoszenia

source: Group Work
ja: グループワーク
pl: Praca grupowa

source: Leaderboards
ja: リーダーボード
pl: Rankingi liderów

source: Discussion
ja: ディスカッション
pl: Dyskusja

source: Other
ja: その他
pl: Inne

source: Today at
ja: 今日
pl: Dzisiaj o

source: responded:
ja: 回答済み：
pl: przesłał(a) odpowiedź:

source: posted:
ja: 投稿済み：
pl: opublikował(a):

source: Your response to
ja: あなたの回答
pl: Twoja odpowiedź na

source: was upvoted
ja: 票の賛成票が入りました
pl: została polubiona przez

source: times
ja: は
pl: użytkowników

source: has flagged a post entitled
ja: が投稿に資格ありのフラグを付けました
pl: oznaczył(a) post zatytułowany

source: Your post
ja: あなたの投稿
pl: Twój post

source: responded to your post in
ja: があなたの次の投稿に回答しました。
pl: odpowiedział(a) na Twój post

source: was followed
ja: 回フォローされました
pl: jest obserwowany przez

source: uploaded a file
ja: がファイルをアップロードしました
pl: przesłał(a) plik

source: Grade(s) are
ja: 成績：
pl: Ocena(-y)

source: posted
ja: 投稿済み
pl: zostały opublikowane

source: due
ja: 期日：
pl: oczekują na opublikowanie

source: are
ja: は
pl: są

source: open
ja: オープンです
pl: otwarte

source: You are now
ja: あなたは今コホートで
pl: Obecnie jesteś

source: for
ja: 位（
pl: na

source: in the cohort!
ja: ）です。
pl: w grupie kursantów!

source: Progress
ja: 進度
